wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl_ethernet_def.h
/**
*********************************************************************************************************
*               Copyright(c) 2024, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* \file     rtl_ethernet_def.h
* \brief    Ethernet related definitions
* \details
* \author   colin
* \date     2024-06-28
* \version  v1.0
* *********************************************************************************************************
*/

#ifndef RTL_ETHERNET_DEF_H
#define RTL_ETHERNET_DEF_H

#include <stddef.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include "rtl876x.h"

#ifdef  __cplusplus
extern "C" {
#endif /* __cplusplus */

/*============================================================================*
 *                          ETHERNET Defines
 *============================================================================*/
#define ETH_SUPPORT_CLOCK_CONFIG                    (1)

/// Defines the max. timeout value when checking the flag of MDIO operations
#define ETH_TIMEOUT_CNT_MAX                 2000000

#define ETH_PHY_DEFAULT_RX_SETUP_TIME       ETH_PHY_RX_SETUP_TIME_16NS
#define ETH_PHY_DEFAULT_TX_SETUP_TIME       ETH_PHY_TX_SETUP_TIME_12NS

#define DEBUG_ETH

#ifdef DEBUG_ETH
#define ETH_DBG_MODULE      MODULE_IO
#define DEBUG_FPGA
#ifdef DEBUG_FPGA
#define ETH_DBG_BUFFER(MODULE, LEVEL, fmt, para_num,...) DBG_DIRECT(fmt, ##__VA_ARGS__)
#else
#define ETH_DBG_BUFFER(MODULE, LEVEL, fmt, para_num,...) DBG_BUFFER_##LEVEL(TYPE_BB2, SUBTYPE_FORMAT, MODULE, fmt, para_num, ##__VA_ARGS__)
#endif
#else
#define ETH_DBG_BUFFER(MODULE, LEVEL, fmt, para_num,...) ((void)0)
#endif

/*============================================================================*
 *                         Types
 *============================================================================*/
#if (ETH_SUPPORT_CLOCK_CONFIG == 1)
typedef enum
{
    ETH_CLK_100M,
    ETH_CLK_50M,
} ETHClk_TypeDef;

#define IS_ETH_CLK(CLK)                 (((CLK) == ETH_CLK_100M) || \
                                         ((CLK) == ETH_CLK_50M))

typedef enum
{
    ETH_CLK_PLL1,
    ETH_CLK_PLL3,
} ETHClkSrc_TypeDef;

#define IS_ETH_CLK_SRC(CLK_SRC)         (((CLK_SRC) == ETH_CLK_PLL1) || \
                                         ((CLK_SRC) == ETH_CLK_PLL3))

typedef enum
{
    ETH_CLK_DIV_1 = 0x0,
    ETH_CLK_DIV_2 = 0x1,
    ETH_CLK_DIV_4 = 0x2,
    ETH_CLK_DIV_8 = 0x3,
    ETH_CLK_DIV_16 = 0x4,
    ETH_CLK_DIV_32 = 0x5,
    ETH_CLK_DIV_40 = 0x6,
    ETH_CLK_DIV_64 = 0x7,
} ETHClkDiv_TypeDef;

#define IS_ETH_CLK_DIV(DIV)             (((DIV) == ETH_CLK_DIV_1)  || \
                                         ((DIV) == ETH_CLK_DIV_2)  || \
                                         ((DIV) == ETH_CLK_DIV_4)  || \
                                         ((DIV) == ETH_CLK_DIV_8)  || \
                                         ((DIV) == ETH_CLK_DIV_16) || \
                                         ((DIV) == ETH_CLK_DIV_32) || \
                                         ((DIV) == ETH_CLK_DIV_40) || \
                                         ((DIV) == ETH_CLK_DIV_64))
#endif

/*============================================================================*
 *                          ETHERNET Registers and Field Descriptions
 *============================================================================*/
/* 0x00
    7:0     R/W    idr3                    8'h0
    15:8    R/W    idr2                    8'h0
    23:16   R/W    idr1                    8'h0
    31:24   R/W    idr0                    8'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t idr3: 8;
        uint32_t idr2: 8;
        uint32_t idr1: 8;
        uint32_t idr0: 8;
    } b;
} ETH_IDR0_TypeDef;

/* 0x04
    15:0    R/W    reserved15_0            16'h0
    23:16   R/W    idr5                    8'h0
    31:24   R/W    idr4                    8'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t reserved_0: 16;
        uint32_t idr5: 8;
        uint32_t idr4: 8;
    } b;
} ETH_IDR4_TypeDef;

/* 0x08
    7:0     R/W    mar3                    8'h0
    15:8    R/W    mar2                    8'h0
    23:16   R/W    mar1                    8'h0
    31:24   R/W    mar0                    8'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t mar3: 8;
        uint32_t mar2: 8;
        uint32_t mar1: 8;
        uint32_t mar0: 8;
    } b;
} ETH_MAR0_TypeDef;

/* 0x0C
    7:0     R/W    mar7                    8'h0
    15:8    R/W    mar6                    8'h0
    23:16   R/W    mar5                    8'h0
    31:24   R/W    mar4                    8'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t mar7: 8;
        uint32_t mar6: 8;
        uint32_t mar5: 8;
        uint32_t mar4: 8;
    } b;
} ETH_MAR4_TypeDef;

/* 0x10
    15:0    R/WC   tx_ok                   16'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        uint16_t txok: 16;
    } b;
} ETH_TXOKCNT_TypeDef;

/* 0x12
    15:0    R/WC   rx_ok                   16'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        uint16_t rx_ok: 16;
    } b;
} ETH_RXOKCNT_TypeDef;

/* 0x14
    15:0    R/WC   tx_err                  16'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        uint16_t tx_err: 16;
    } b;
} ETH_TXERR_TypeDef;

/* 0x16
    15:0    R/WC   rx_err                  16'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        uint16_t rx_err: 16;
    } b;
} ETH_RXERR_TypeDef;

/* 0x18
    15:0    R/WC   miss_pkt                16'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        uint16_t miss_pkt: 16;
    } b;
} ETH_MISSPKT_TypeDef;

/* 0x1A
    15:0    R/WC   fae                     16'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        uint16_t fae: 16;
    } b;
} ETH_FAE_TypeDef;

/* 0x1C
    15:0    R/WC   tx1_col                 16'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        uint16_t tx1_col: 16;
    } b;
} ETH_TX1COL_TypeDef;

/* 0x1E
    15:0    R/WC   txm_col                 16'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        uint16_t txm_col: 16;
    } b;
} ETH_TXMCOL_TypeDef;

/* 0x20
    15:0    R/WC   rx_ok_phy               16'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        uint16_t rx_ok_phy: 16;
    } b;
} ETH_RXOKPHY_TypeDef;

/* 0x22
    15:0    R/WC   rx_ok_brd               16'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        uint16_t rx_ok_brd: 16;
    } b;
} ETH_RXOKBRD_TypeDef;

/* 0x24
    15:0    R/WC   rx_ok_mul               16'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        uint16_t rx_ok_mul: 16;
    } b;
} ETH_RXOKMU1_TypeDef;

/* 0x26
    15:0    R/WC   tx_abt                  16'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        uint16_t tx_abt: 16;
    } b;
} ETH_TXABT_TypeDef;

/* 0x28
    15:0    R/WC   tx_under_run            16'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        uint16_t tx_under_run: 16;
    } b;
} ETH_TXUNDERC_TypeDef;

/* 0x2A
    15:0    R/WC   rdu_miss_pktc           16'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        uint16_t rdu_miss_pktc: 16;
    } b;
} ETH_MISSPKT_RDU_TypeDef;

/* 0x34
    0       R      rdu                     1'h0
    1       R      rx_fifo_empty           1'h1
    2       R      tx_under_run            1'h0
    3       R      tok                     1'h0
    31:4    R      reserved31_4            28'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t rdu: 1;
        const uint32_t rx_fifo_empty: 1;
        const uint32_t tx_under_run: 1;
        const uint32_t tok: 1;
        const uint32_t reserved_0: 28;
    } b;
} ETH_TRSR_TypeDef;

