wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl_ethernet_def.h
/* 0x38
    0       W      rst                     1'h0
    1       R/W    rx_chk_sum              1'h0
    2       R/W    rx_vlan                 1'h0
    3       R/W    rx_jumbo                1'h0
    4       R/W    dis_lso_err             1'h0
    5       R/W    tdsc_debug              1'h0
    31:6    R/W    reserved31_6            26'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t rst: 1;
        uint32_t rx_chk_sum: 1;
        uint32_t rx_vlan: 1;
        uint32_t rx_jumbo: 1;
        uint32_t dis_lso_err: 1;
        uint32_t tdsc_debug: 1;
        uint32_t reserved_0: 26;
    } b;
} ETH_CR_TypeDef;

/* 0x3C
    0       R/W1C  s_rok                   1'h0
    1       R/W1C  s_cnt_wrap              1'h0
    2       R/W1C  s_rer_runt              1'h0
    3       R/W    reserved3               1'h0
    4       R/W1C  s_rer_ovf               1'h0
    5       R/W1C  s_rdu                   1'h0
    6       R/W1C  s_tok_or_ti             1'h0
    7       R/W1C  s_ter                   1'h0
    8       R/W1C  s_link_chg              1'h0
    9       R/W1C  s_tdu                   1'h0
    10      R/W1C  s_swint                 1'h1
    11      R/W1C  s_rdu2                  1'h0
    12      R/W1C  s_rdu3                  1'h0
    13      R/W1C  s_rdu4                  1'h0
    14      R/W1C  s_rdu5                  1'h0
    15      R/W1C  s_rdu6                  1'h0
    16      R/W    rok                     1'h0
    17      R/W    cnt_wrap                1'h0
    18      R/W    rer_runt                1'h0
    19      R/W    reserved19              1'h0
    20      R/W    rer_ovf                 1'h0
    21      R/W    rdu                     1'h0
    22      R/W    tok_or_ti               1'h0
    23      R/W    ter                     1'h0
    24      R/W    link_chg                1'h0
    25      R/W    tdu                     1'h0
    26      R/W    swint                   1'h0
    27      R/W    rdu2                    1'h0
    28      R/W    rdu3                    1'h0
    29      R/W    rdu4                    1'h0
    30      R/W    rdu5                    1'h0
    31      R/W    rdu6                    1'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t s_rok: 1;
        uint32_t s_cnt_wrap: 1;
        uint32_t s_rer_runt: 1;
        uint32_t reserved_1: 1;
        uint32_t s_rer_ovf: 1;
        uint32_t s_rdu: 1;
        uint32_t s_tok_or_ti: 1;
        uint32_t s_ter: 1;
        uint32_t s_link_chg: 1;
        uint32_t s_tdu: 1;
        uint32_t s_swint: 1;
        uint32_t s_rdu2: 1;
        uint32_t s_rdu3: 1;
        uint32_t s_rdu4: 1;
        uint32_t s_rdu5: 1;
        uint32_t s_rdu6: 1;
        uint32_t rok: 1;
        uint32_t cnt_wrap: 1;
        uint32_t rer_runt: 1;
        uint32_t reserved_0: 1;
        uint32_t rer_ovf: 1;
        uint32_t rdu: 1;
        uint32_t tok_or_ti: 1;
        uint32_t ter: 1;
        uint32_t link_chg: 1;
        uint32_t tdu: 1;
        uint32_t swint: 1;
        uint32_t rdu2: 1;
        uint32_t rdu3: 1;
        uint32_t rdu4: 1;
        uint32_t rdu5: 1;
        uint32_t rdu6: 1;
    } b;
} ETH_ISR_IMR_TypeDef;

/* 0x40
    7:0     R/W    reserved7_0             8'h0
    9:8     R/W    lpbk                    2'h0
    12:10   R/W    inter_frm_gp_tm         3'h0
    31:13   R/W    reserved31_13           20'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t reserved_1: 8;
        uint32_t lpbk: 2;
        uint32_t inter_frm_gp_tm: 3;
        uint32_t reserved_0: 19;
    } b;
} ETH_TCR_TypeDef;

/* 0x44
    0       R/W    accept_all_pkt          1'h0
    1       R/W    accept_phy_mtch_pkt     1'h0
    2       R/W    accept_mltcst_pkt       1'h0
    3       R/W    accept_brdcst_pkt       1'h0
    4       R/W    accept_runt_pkt         1'h0
    5       R/W    accept_err_pkt          1'h0
    6       R/W    accept_flw_ctl_pkt      1'h0
    7       R/W    home_pna                1'h0
    31:8    R/W    reserved31_8            24'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t accept_all_pkt: 1;
        uint32_t accept_phy_mtch_pkt: 1;
        uint32_t accept_mltcst_pkt: 1;
        uint32_t accept_brdcst_pkt: 1;
        uint32_t accept_runt_pkt: 1;
        uint32_t accept_err_pkt: 1;
        uint32_t accept_flw_ctl_pkt: 1;
        uint32_t home_pna: 1;
        uint32_t reserved_0: 24;
    } b;
} ETH_RCR_TypeDef;

/* 0x48
    7:0     R/W    cpu_tg_prtcl_val        8'h0
    15:8    R/W    cpu_tg_prtcl_msk        8'h0
    17:16   R/W    ct_rsize_1_0            2'h0
    21:18   R/W    cpu_tg_switch           4'h0
    22      R/W    cpu_tg_aspri            1'h1
    23      R/W    cpu_tg_normk            1'h0
    24      R/W    cpu_tg_dsbl_lrn         1'h1
    26:25   R/W    cpu_tg_rsize_3_2        2'h0
    30:27   R/W    cpu_tg_tsize            4'h0
    31      R/W    cpu_tg_rx_en            1'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t cpu_tg_prtcl_val: 8;
        uint32_t cpu_tg_prtcl_msk: 8;
        uint32_t ct_rsize_1_0: 2;
        uint32_t cpu_tg_switch: 4;
        uint32_t cpu_tg_aspri: 1;
        uint32_t cpu_tg_normk: 1;
        uint32_t cpu_tg_dsbl_lrn: 1;
        uint32_t cpu_tg_rsize_3_2: 2;
        uint32_t cpu_tg_tsize: 4;
        uint32_t cpu_tg_rx_en: 1;
    } b;
} ETH_CPUTAG_TypeDef;

/* 0x4C
    23:0    R/W    reserved23_0            24'h0
    24      R/W    en_int_split            1'h0
    25      R/W    en_int_route            1'h0
    26      R/W    r_mdslv_out_edge        1'h0
    27      R/W    r_tso_id_sel            1'h0
    29:28   R/W    rff_size_sel            2'h2
    31:30   R/W    reserved31_30           2'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t reserved_1: 24;
        uint32_t en_int_split: 1;
        uint32_t en_int_route: 1;
        uint32_t r_mdslv_out_edge: 1;
        uint32_t r_tso_id_sel: 1;
        uint32_t rff_size_sel: 2;
        uint32_t reserved_0: 2;
    } b;
} ETH_CONFIG_TypeDef;

