wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl_ethernet_def.h
/* 0x50
    2:0     R/W    spa_pon                 3'h0
    3       R/W    reserved3               1'h0
    6:4     R/W    spa_dsl                 3'h0
    31:7    R/W    reserved31_7            26'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t spa_pon: 3;
        uint32_t reserved_1: 1;
        uint32_t spa_dsl: 3;
        uint32_t reserved_0: 25;
    } b;
} ETH_CPUTAG1_TypeDef;

/* 0x58
    0       R/W    refclk_on               1'h1
    1       R/W    tx_refclk_phase         1'h0
    3:2     R/W    reserved3_2             1'h0
    4       R/W    rx_refclk_phase         1'h0
    5       R/W    reserved5               1'h0
    6       R      eth_md_mst              1'h1
    7       R/W    reg_rmii2mii_en         1'h0
    9:8     R      eee_aby                 2'h0
    10      R/W    force_spd_mode          1'h0
    11      R/W    rgmii_tx_encode_sts     1'h0
    12      R/W    rgmii_rx_decode_sts     1'h0
    13      R/W    eth_phy_mode            1'h0
    14      R/W    reserved14              1'h0
    15      R      eth_sel_phyif_0         1'h1
    17:16   R/W    force_spd               2'h3
    18      R/W    force_link              1'h0
    19      R/W    force_full_dup          1'h0
    20      R      sel_mii                 1'h1
    21      R      nw_complete             1'h1
    22      R      full_dupreg             1'h1
    23      R/W    sel_rgmii               1'h0
    24      R      rx_pf                   1'h0
    25      R      tx_pf                   1'h0
    26      R      link_status             1'h0
    27      R      speed_10                1'h0
    28      R      speed_1000              1'h0
    29      R/W    tx_flow_ctr_en          1'h0
    30      R/W    rx_flow_ctr_en          1'h0
    31      R/W    force_txrx_flow_ctr_en  1'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t refclk_on: 1;
        uint32_t tx_refclk_phase: 1;
        uint32_t reserved_2: 2;
        uint32_t rx_refclk_phase: 1;
        uint32_t reserved_1: 1;
        const uint32_t eth_md_mst: 1;
        uint32_t reg_rmii2mii_en: 1;
        const uint32_t eee_aby: 2;
        uint32_t force_spd_mode: 1;
        uint32_t rgmii_tx_encode_sts: 1;
        uint32_t rgmii_rx_decode_sts: 1;
        uint32_t eth_phy_mode: 1;
        uint32_t reserved_0: 1;
        const uint32_t eth_sel_phyif_0: 1;
        uint32_t force_spd: 2;
        uint32_t force_link: 1;
        uint32_t force_full_dup: 1;
        const uint32_t sel_mii: 1;
        const uint32_t nw_complete: 1;
        const uint32_t full_dupreg: 1;
        uint32_t sel_rgmii: 1;
        const uint32_t rx_pf: 1;
        const uint32_t tx_pf: 1;
        const uint32_t link_status: 1;
        const uint32_t link_speed: 2;
        uint32_t tx_flow_ctr_en: 1;
        uint32_t rx_flow_ctr_en: 1;
        uint32_t force_txrx_flow_ctr_en: 1;
    } b;
} ETH_MSR_TypeDef;

/* 0x5C
    15:0    R/W    data15_0                16'h0
    20:16   R/W    reg_addr4_0             5'h0
    21      R/W    polling_eee_reg         1'h0
    22      R/W    disable_auto_polling    1'h0
    23      R/W    en_eeepauto_write       1'h0
    24      R/W    reserved24              1'h0
    25      R      mdio_busy               1'h0
    30:26   R/W    phy_address             5'h0
    31      R/W    flag                    1'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t data15_0: 16;
        uint32_t reg_addr4_0: 5;
        uint32_t polling_eee_reg: 1;
        uint32_t disable_auto_polling: 1;
        uint32_t en_eeepauto_write: 1;
        uint32_t reserved_0: 1;
        const uint32_t mdio_busy: 1;
        uint32_t phy_address: 5;
        uint32_t flag: 1;
    } b;
} ETH_MIIAR_TypeDef;

/* 0x60
    23:0    R/W    reserved23_0            24'h0
    24      W/SC   swint                   1'h0
    31:25   R/W    reserved31_25           7'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t reserved_1: 24;
        uint32_t swint: 1;
        uint32_t reserved_0: 7;
    } b;
} ETH_SWINT_TypeDef;

/* 0x64
    14:0    R/W    reserved14_0            15'h0
    15      R/W    tdsc_vlan_type          1'h0
    31:16   R/W    stag_pid                15'h88a8
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t reserved_0: 15;
        uint32_t tdsc_vlan_type: 1;
        uint32_t stag_pid: 16;
    } b;
} ETH_VLAN_TypeDef;

/* 0x70
    3:0     R/W    led_sel_0               4'h0
    7:4     R/W    led_sel_1               4'h0
    11:8    R/W    led_sel_2               4'h0
    15:12   R/W    led_sel_3               4'h0
    17:16   R/W    led_sel                 2'h0
    18      R/W    custom_led              1'h0
    19      R/W    eee_en_led              1'h0
    31:20   R/W    reserved31_20           12'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t led_sel_0: 4;
        uint32_t led_sel_1: 4;
        uint32_t led_sel_2: 4;
        uint32_t led_sel_3: 4;
        uint32_t led_sel: 2;
        uint32_t custom_led: 1;
        uint32_t eee_en_led: 1;
        uint32_t reserved_0: 12;
    } b;
} ETH_LED_CTRL_TypeDef;

/* 0x80
    3:0     R/W    csr_tff_dvs             4'h0
    4       R/W    csr_tff_dvse            1'h0
    5       R/W    csr_tff_nap             1'h0
    6       R/W    csr_tff_tmck            1'h0
    7       R/W    reserved7               1'h0
    11:8    R/W    csr_rff_dvs             4'h0
    12      R/W    csr_rff_dvse            1'h0
    13      R/W    csr_rff_nap             1'h0
    14      R/W    csr_rff_tmck            1'h0
    31:15   R/W    reserved31_15           17'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t csr_tff_dvs: 4;
        uint32_t csr_tff_dvse: 1;
        uint32_t csr_tff_nap: 1;
        uint32_t csr_tff_tmck: 1;
        uint32_t reserved_1: 1;
        uint32_t csr_rff_dvs: 4;
        uint32_t csr_rff_dvse: 1;
        uint32_t csr_rff_nap: 1;
        uint32_t csr_rff_tmck: 1;
        uint32_t reserved_0: 17;
    } b;
} ETH_BIST_TypeDef;

