wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl_ethernet_def.h
/* 0x84
    7:0     R/W    pglbk_data_pat          8'h0
    8       R/W    r_disable_txcrc         1'h0
    10:9    R/W    pglbk_pkt_num_sel       2'h0
    11      R/W    pblbk_pkt_length_sel    1'h0
    12      R      pglbk_fail              1'h0
    13      R      pglbk_done              1'h0
    14      R/W    pglbk_data_pat_sel      1'h0
    15      R/W    en_pglbk                1'h0
    31:16   R/W    reserved31_16           16'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t pglbk_data_pat: 8;
        uint32_t r_disable_txcrc: 1;
        uint32_t pglbk_pkt_num_sel: 2;
        uint32_t pblbk_pkt_length_sel: 1;
        const uint32_t pglbk_fail: 1;
        const uint32_t pglbk_done: 1;
        uint32_t pglbk_data_pat_sel: 1;
        uint32_t en_pglbk: 1;
        uint32_t reserved_0: 16;
    } b;
} ETH_PGLBK_TypeDef;

/* 0x88
    1:0     R/W    eee_timer_unit_100_2    1'h0
    3:2     R/W    eee_timer_unit_100_1    1'h0
    5:4     R/W    eee_timer_unit_giga_2   1'h0
    7:6     R/W    eee_timer_unit_giga_1   1'h0
    8       R/W    eee_tx_timer_en         1'h0
    9       R/W    eee_rx_timer_en         1'h0
    10      R/W    eee_reqset0             1'h0
    11      R/W    eee_reqset1             1'h0
    12      R/W    eee_reqset2             1'h0
    13      R/W    eee_wake_set0           1'h0
    14      R/W    eee_wake_set1           1'h0
    15      R/W    reserved15              1'h0
    16      R      eee_pause_flag          1'h0
    17      R      eee_rx_sts              1'h0
    18      R      eee_tx_sts              1'h0
    19      R      eee_sts                 1'h0
    22:20   R/W    reserved22_20           3'h0
    23      R/W    eee_outqlowq_over       1'h0
    25:24   R/W    reserved25_24           2'h0
    26      R/W    en_eee_rx               1'h0
    27      R/W    en_eee_tx               1'h0
    28      R/W    en_eee_10m              1'h0
    29      R/W    frc_eee_100m            1'h0
    30      R/W    frc_eee_giga            1'h0
    31      R/W    en_frc_eee              1'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t eee_timer_unit_100_2: 2;
        uint32_t eee_timer_unit_100_1: 2;
        uint32_t eee_timer_unit_giga_2: 2;
        uint32_t eee_timer_unit_giga_1: 2;
        uint32_t eee_tx_timer_en: 1;
        uint32_t eee_rx_timer_en: 1;
        uint32_t eee_reqset0: 1;
        uint32_t eee_reqset1: 1;
        uint32_t eee_reqset2: 1;
        uint32_t eee_wake_set0: 1;
        uint32_t eee_wake_set1: 1;
        uint32_t reserved_2: 1;
        const uint32_t eee_pause_flag: 1;
        const uint32_t eee_rx_sts: 1;
        const uint32_t eee_tx_sts: 1;
        const uint32_t eee_sts: 1;
        uint32_t reserved_1: 3;
        uint32_t eee_outqlowq_over: 1;
        uint32_t reserved_0: 2;
        uint32_t en_eee_rx: 1;
        uint32_t en_eee_tx: 1;
        uint32_t en_eee_10m: 1;
        uint32_t frc_eee_100m: 1;
        uint32_t frc_eee_giga: 1;
        uint32_t en_frc_eee: 1;
    } b;
} ETH_EEE_CR1_TypeDef;

/* 0x8C
    7:0     R/W    eee_timer_tp_giga       8'h0a
    15:8    R/W    eee_timer_td_giga       8'hc4
    23:16   R/W    eee_timer_tr_giga       8'h0a
    31:24   R/W    eee_timer_tw_giga       8'h10
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t eee_timer_tp_giga: 8;
        uint32_t eee_timer_td_giga: 8;
        uint32_t eee_timer_tr_giga: 8;
        uint32_t eee_timer_tw_giga: 8;
    } b;
} ETH_EEE_CR2_TypeDef;

/* 0x90
    7:0     R/W    eee_timer_tp_100        8'h0a
    15:8    R/W    eee_timer_td_100        8'hf4
    23:16   R/W    eee_timer_tr_100        8'h0a
    31:24   R/W    eee_timer_tw_100        8'h1e
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t eee_timer_tp_100: 8;
        uint32_t eee_timer_td_100: 8;
        uint32_t eee_timer_tr_100: 8;
        uint32_t eee_timer_tw_100: 8;
    } b;
} ETH_EEE_CR3_TypeDef;

/* 0x94
    15:0    R/W    eee_tx_thr_100          15'h003e
    31:16   R/W    eee_tx_thr_giga         15'h0271
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t eee_tx_thr_100: 16;
        uint32_t eee_tx_thr_giga: 16;
    } b;
} ETH_EEE_CR4_TypeDef;

/* 0x98
    21:0    RC     eee_rxlpi_time          22'h0
    31:22   R/W    reserved31_22           10'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t eee_rxlpi_time: 22;
        uint32_t reserved_0: 10;
    } b;
} ETH_EEE_LPI_TMO_TypeDef;

/* 0x9C
    21:0    RC     eee_txlpi_time          22'h0
    22      R/W    eee_trxctl_level        1'h0
    23      R/W    eee_stop_txc            1'h0
    31:24   R/W    reserved31_24           8'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t eee_txlpi_time: 22;
        uint32_t eee_trxctl_level: 1;
        uint32_t eee_stop_txc: 1;
        uint32_t reserved_0: 8;
    } b;
} ETH_EEE_LPI_TM1_TypeDef;

/* 0xB0
    15:0    R/W    reserved15_0            16'h0
    22:16   R/W    eeep_dbg_sgl_sel        1'h0
    23      R/W    reserved23              1'h0
    24      R/W    phy_mst_mode            1'h0
    25      R/W    reserved25              1'h0
    26      R/W    cfg_eeep_defer_txlpi    1'h0
    27      R/W    cfg_en_eeep_100m        1'h0
    28      R/W    cfg_en_eeep_giga        1'h0
    29      R/W    cfg_en_eeep_tx          1'h0
    30      R/W    cfg_en_eeep_rx          1'h0
    31      R/W    en_eeep                 1'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t reserved_2: 16;
        uint32_t eeep_dbg_sgl_sel: 7;
        uint32_t reserved_1: 1;
        uint32_t phy_mst_mode: 1;
        uint32_t reserved_0: 1;
        uint32_t cfg_eeep_defer_txlpi: 1;
        uint32_t cfg_en_eeep_100m: 1;
        uint32_t cfg_en_eeep_giga: 1;
        uint32_t cfg_en_eeep_tx: 1;
        uint32_t cfg_en_eeep_rx: 1;
        uint32_t en_eeep: 1;
    } b;
} ETH_EEEP_CR1_TypeDef;

