wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl_ethernet_def.h
/* 0xB4
    7:0     R/W    eeep_sleep_step         8'h1
    31:8    R/W    reserved31_8            24'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t eeep_sleep_step: 8;
        uint32_t reserved_0: 24;
    } b;
} ETH_EEEP_CR2_TypeDef;

/* 0xB8
    15:0    R/W    eeep_rx_thr             16'hf0
    31:16   R/W    eeep_tx_thr             16'hf0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t eeep_rx_thr: 16;
        uint32_t eeep_tx_thr: 16;
    } b;
} ETH_EEEP_CR3_TypeDef;

/* 0xBC
    7:0     R/W    eeep_timer_pause        8'h1
    15:8    R/W    eeep_timer_tx_wait      8'h1
    23:16   R/W    eeep_timer_rx_wake      8'h2
    31:24   R/W    eeep_time_rx_rate       8'hc
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t eeep_timer_pause: 8;
        uint32_t eeep_timer_tx_wait: 8;
        uint32_t eeep_timer_rx_wake: 8;
        uint32_t eeep_time_rx_rate: 8;
    } b;
} ETH_EEEP_CR4_TypeDef;

/* 0xC0
    7:0     R/W    eeep_timer_rx_sleep     8'hc
    9:8     R/W    eeep_timer_unit         2'h1
    15:10   R/W    reserved1               6'h0
    23:16   R/W    eeep_tx_rate            8'h0
    31:24   R/W    reserved31_24           8'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t eeep_timer_rx_sleep: 8;
        uint32_t eeep_timer_unit: 2;
        uint32_t reserved_1: 6;
        uint32_t eeep_tx_rate: 8;
        uint32_t reserved_0: 8;
    } b;
} ETH_EEEP_CR5_TypeDef;

/* 0xC4
    15:0    R/W    eeep_abig_off           16'h800a
    31:16   R/W    eeep_abig_on            16'hb80a
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t eeep_abig_off: 16;
        uint32_t eeep_abig_on: 16;
    } b;
} ETH_EEEP_CR6_TypeDef;

/* 0xC8
    15:0    R/W    eeep_ldvbias_off        15'h0550
    31:16   R/W    eeep_ldvbias_on         15'h7550
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t eeep_ldvbias_off: 16;
        uint32_t eeep_ldvbias_on: 16;
    } b;
} ETH_EEEP_CR7_TypeDef;

/* 0xD0
    0       RO     imr0_rok1               1'h0
    1       R/W    imr0_rok2               1'h0
    2       R/W    imr0_rok3               1'h0
    3       R/W    imr0_rok4               1'h0
    4       R/W    imr0_rok5               1'h0
    5       R/W    imr0_rok6               1'h0
    15:6    R/W    reserved15_6            10'h0
    16      RO     imr0_tok1               1'h0
    17      R/W    imr0_tok2               1'h0
    18      R/W    imr0_tok3               1'h0
    19      R/W    imr0_tok4               1'h0
    20      R/W    imr0_tok5               1'h0
    23:21   R/W    reserved23_21           3'h0
    24      RO     imr0_tdu1               1'h0
    25      R/W    imr0_tdu2               1'h0
    26      R/W    imr0_tdu3               1'h0
    27      R/W    imr0_tdu4               1'h0
    28      R/W    imr0_tdu5               1'h0
    31:29   R/W    reserved31_29           3'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t imr0_rok1: 1;
        uint32_t imr0_rok2: 1;
        uint32_t imr0_rok3: 1;
        uint32_t imr0_rok4: 1;
        uint32_t imr0_rok5: 1;
        uint32_t imr0_rok6: 1;
        uint32_t reserved_2: 10;
        const uint32_t imr0_tok1: 1;
        uint32_t imr0_tok2: 1;
        uint32_t imr0_tok3: 1;
        uint32_t imr0_tok4: 1;
        uint32_t imr0_tok5: 1;
        uint32_t reserved_1: 3;
        const uint32_t imr0_tdu1: 1;
        uint32_t imr0_tdu2: 1;
        uint32_t imr0_tdu3: 1;
        uint32_t imr0_tdu4: 1;
        uint32_t imr0_tdu5: 1;
        uint32_t reserved_0: 3;
    } b;
} ETH_IMR0_TypeDef;

/* 0xD4
    0       R/W    imr1_rok1               1'h0
    1       R/W    imr1_rok2               1'h0
    2       R/W    imr1_rok3               1'h0
    3       R/W    imr1_rok4               1'h0
    4       R/W    imr1_rok5               1'h0
    5       R/W    imr1_rok6               1'h0
    7:6     R/W    reserved7_6             2'h0
    8       R/W    imr1_rdu1               1'h0
    9       R/W    imr1_rdu2               1'h0
    10      R/W    imr1_rdu3               1'h0
    11      R/W    imr1_rdu4               1'h0
    12      R/W    imr1_rdu5               1'h0
    13      R/W    imr1_rdu6               1'h0
    15:14   R/W    reserved15_14           2'h0
    16      R/W    imr1_tok1               1'h0
    17      R/W    imr1_tok2               1'h0
    18      R/W    imr1_tok3               1'h0
    19      R/W    imr1_tok4               1'h0
    20      R/W    imr1_tok5               1'h0
    23:21   R/W    reserved23_21           3'h0
    24      R/W    imr1_tdu1               1'h0
    25      R/W    imr1_tdu2               1'h0
    26      R/W    imr1_tdu3               1'h0
    27      R/W    imr1_tdu4               1'h0
    28      R/W    imr1_tdu5               1'h0
    31:29   R/W    reserved31_29           3'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t imr1_rok1: 1;
        uint32_t imr1_rok2: 1;
        uint32_t imr1_rok3: 1;
        uint32_t imr1_rok4: 1;
        uint32_t imr1_rok5: 1;
        uint32_t imr1_rok6: 1;
        uint32_t reserved_3: 2;
        uint32_t imr1_rdu1: 1;
        uint32_t imr1_rdu2: 1;
        uint32_t imr1_rdu3: 1;
        uint32_t imr1_rdu4: 1;
        uint32_t imr1_rdu5: 1;
        uint32_t imr1_rdu6: 1;
        uint32_t reserved_2: 2;
        uint32_t imr1_tok1: 1;
        uint32_t imr1_tok2: 1;
        uint32_t imr1_tok3: 1;
        uint32_t imr1_tok4: 1;
        uint32_t imr1_tok5: 1;
        uint32_t reserved_1: 3;
        uint32_t imr1_tdu1: 1;
        uint32_t imr1_tdu2: 1;
        uint32_t imr1_tdu3: 1;
        uint32_t imr1_tdu4: 1;
        uint32_t imr1_tdu5: 1;
        uint32_t reserved_0: 3;
    } b;
} ETH_IMR1_TypeDef;

/* 0xD8
    0       RO     isr_rok1                1'h0
    1       R/W1C  isr_rok2                1'h0
    2       R/W1C  isr_rok3                1'h0
    3       R/W1C  isr_rok4                1'h0
    4       R/W1C  isr_rok5                1'h0
    5       R/W1C  isr_rok6                1'h0
    15:6    R/W    reserved15_6            10'h0
    16      RO     isr_tok1                1'h0
    17      R/W1C  isr_tok2                1'h0
    18      R/W1C  isr_tok3                1'h0
    19      R/W1C  isr_tok4                1'h0
    20      R/W1C  isr_tok5                1'h0
    23:21   R/W    reserved23_21           3'h0
    24      RO     isr_tdu1                1'h0
    25      R/W1C  isr_tdu2                1'h0
    26      R/W1C  isr_tdu3                1'h0
    27      R/W1C  isr_tdu4                1'h0
    28      R/W1C  isr_tdu5                1'h0
    31:29   R/W    reserved31_29           3'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t isr_rok1: 1;
        uint32_t isr_rok2: 1;
        uint32_t isr_rok3: 1;
        uint32_t isr_rok4: 1;
        uint32_t isr_rok5: 1;
        uint32_t isr_rok6: 1;
        uint32_t reserved_2: 10;
        const uint32_t isr_tok1: 1;
        uint32_t isr_tok2: 1;
        uint32_t isr_tok3: 1;
        uint32_t isr_tok4: 1;
        uint32_t isr_tok5: 1;
        uint32_t reserved_1: 3;
        const uint32_t isr_tdu1: 1;
        uint32_t isr_tdu2: 1;
        uint32_t isr_tdu3: 1;
        uint32_t isr_tdu4: 1;
        uint32_t isr_tdu5: 1;
        uint32_t reserved_0: 3;
    } b;
} ETH_ISR1_TypeDef;

/* 0xDC
    0       R/W    rr1_int_routing         1'h0
    1       R/W    reserved1               1'h0
    2       R/W    rr2_int_routing         1'h0
    3       R/W    reserved3               1'h0
    4       R/W    rr3_int_routing         1'h0
    5       R/W    reserved5               1'h0
    6       R/W    rr4_int_routing         1'h0
    7       R/W    reserved7               1'h0
    8       R/W    rr5_int_routing         1'h0
    9       R/W    reserved9               1'h0
    10      R/W    rr6_int_routing         1'h0
    15:11   R/W    reserved15_11           5'h0
    16      R/W    tr1_int_routing         1'h0
    17      R/W    reserved17              1'h0
    18      R/W    tr2_int_routing         1'h0
    19      R/W    reserved19              1'h0
    20      R/W    tr3_int_routing         1'h0
    21      R/W    reserved21              1'h0
    22      R/W    tr4_int_routing         1'h0
    23      R/W    reserved23              1'h0
    24      R/W    tr5_int_routing         1'h0
    31:25   R/W    reserved31_25           7'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t rr1_int_routing: 1;
        uint32_t reserved_10: 1;
        uint32_t rr2_int_routing: 1;
        uint32_t reserved_9: 1;
        uint32_t rr3_int_routing: 1;
        uint32_t reserved_8: 1;
        uint32_t rr4_int_routing: 1;
        uint32_t reserved_7: 1;
        uint32_t rr5_int_routing: 1;
        uint32_t reserved_6: 1;
        uint32_t rr6_int_routing: 1;
        uint32_t reserved_5: 5;
        uint32_t tr1_int_routing: 1;
        uint32_t reserved_4: 1;
        uint32_t tr2_int_routing: 1;
        uint32_t reserved_3: 1;
        uint32_t tr3_int_routing: 1;
        uint32_t reserved_2: 1;
        uint32_t tr4_int_routing: 1;
        uint32_t reserved_1: 1;
        uint32_t tr5_int_routing: 1;
        uint32_t reserved_0: 7;
    } b;
} ETH_INT_R_TypeDef;

/* 0xE0
    0       R/W    auto_link_st_upd        1'h0
    1       R/W    auto_iso_upd            1'h0
    2       R/W    auto_tx_clk_dis         1'h0
    3       R/W    auto_rx_clk_dis         1'h0
    31:4    R/W    reserved31_4            28'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t auto_link_st_upd: 1;
        uint32_t auto_iso_upd: 1;
        uint32_t auto_tx_clk_dis: 1;
        uint32_t auto_rx_clk_dis: 1;
        uint32_t reserved_0: 28;
    } b;
} ETH_RT_PDOCR_TypeDef;

/* 0xE4
    0       R/W    tx_clk_en               1'h1
    1       R/W    rx_clk_en               1'h1
    2       R/W    dma_data_swap           1'h1
    3       R/W    rev_00e4_3              1'h1
    4       R/W    rev_00e4_4              1'h1
    5       R/W    rev_00e4_5              1'h0
    6       R/W    rev_00e4_6              1'h0
    7       R/W    rev_00e4_7              1'h0
    31:8    R/W    reserved31_8            24'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t tx_clk_en: 1;
        uint32_t rx_clk_en: 1;
        uint32_t dma_data_swap: 1;
        uint32_t rev_00e4_3: 1;
        uint32_t rev_00e4_4: 1;
        uint32_t rev_00e4_5: 1;
        uint32_t rev_00e4_6: 1;
        uint32_t rev_00e4_7: 1;
        uint32_t reserved_0: 24;
    } b;
} ETH_CCR_TypeDef;

/* 0xF0
    0       R/W    rst_ntf                 1'h0
    1       R/W    lpbk_ntf                1'h0
    2       R/W    pwr_dwn_ntf             1'h0
    3       R/W    iso_ntf                 1'h0
    4       R/W    lx_slv_to_inten         1'h0
    5       R/W    lx_mst_to_inten         1'h0
    31:6    R/W    reserved31_6            26'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t rst_ntf: 1;
        uint32_t lpbk_ntf: 1;
        uint32_t pwr_dwn_ntf: 1;
        uint32_t iso_ntf: 1;
        uint32_t lx_slv_to_inten: 1;
        uint32_t lx_mst_to_inten: 1;
        uint32_t reserved_0: 26;
    } b;
} ETH_IMR_TypeDef;

