wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl_ethernet_def.h
/* 0xF4
    0       R/W1C  rst_ntf_st              1'h0
    1       R/W1C  lpbk_ntf_st             1'h0
    2       R/W1C  pwr_dwn_ntf_st          1'h0
    3       R/W1C  iso_nft_st              1'h0
    4       R/W    lx_slv_to_int           1'h0
    5       R/W    lx_mst_to_int           1'h0
    31:6    R/W    reserved31_6            26'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t rst_ntf_st: 1;
        uint32_t lpbk_ntf_st: 1;
        uint32_t pwr_dwn_ntf_st: 1;
        uint32_t iso_nft_st: 1;
        uint32_t lx_slv_to_int: 1;
        uint32_t lx_mst_to_int: 1;
        uint32_t reserved_0: 26;
    } b;
} ETH_ISR_TypeDef;


/*============================================================================*
 *                          ETHERNET Registers Memory Map
 *============================================================================*/

typedef struct                       /*!< ETH Structure */
{
    __IO ETH_IDR0_TypeDef  ETH_IDR0;                   /*!< 0x00 */
    __IO ETH_IDR4_TypeDef  ETH_IDR4;                   /*!< 0x04 */
    __IO ETH_MAR0_TypeDef  ETH_MAR0;                   /*!< 0x08 */
    __IO ETH_MAR4_TypeDef  ETH_MAR4;                   /*!< 0x0C */
    __IO ETH_TXOKCNT_TypeDef  ETH_TXOKCNT;             /*!< 0x10 */
    __IO ETH_RXOKCNT_TypeDef  ETH_RXOKCNT;             /*!< 0x12 */
    __IO ETH_TXERR_TypeDef  ETH_TXERR;                 /*!< 0x14 */
    __IO ETH_RXERR_TypeDef  ETH_RXERR;                 /*!< 0x16 */
    __IO ETH_MISSPKT_TypeDef  ETH_MISSPKT;             /*!< 0x18 */
    __IO ETH_FAE_TypeDef  ETH_FAE;                     /*!< 0x1A */
    __IO ETH_TX1COL_TypeDef  ETH_TX1COL;               /*!< 0x1C */
    __IO ETH_TXMCOL_TypeDef  ETH_TXMCOL;               /*!< 0x1E */
    __IO ETH_RXOKPHY_TypeDef  ETH_RXOKPHY;             /*!< 0x20 */
    __IO ETH_RXOKBRD_TypeDef  ETH_RXOKBRD;             /*!< 0x22 */
    __IO ETH_RXOKMU1_TypeDef  ETH_RXOKMU1;             /*!< 0x24 */
    __IO ETH_TXABT_TypeDef  ETH_TXABT;                 /*!< 0x26 */
    __IO ETH_TXUNDERC_TypeDef  ETH_TXUNDERC;           /*!< 0x28 */
    __IO ETH_MISSPKT_RDU_TypeDef  ETH_MISSPKT_RDU;     /*!< 0x2A */
    __IO uint32_t  RSVD0[2];                           /*!< 0x2C */
    __IO ETH_TRSR_TypeDef  ETH_TRSR;                   /*!< 0x34 */
    __IO ETH_CR_TypeDef  ETH_CR;                       /*!< 0x38 */
    __IO ETH_ISR_IMR_TypeDef  ETH_ISR_IMR;             /*!< 0x3C */
    __IO ETH_TCR_TypeDef  ETH_TCR;                     /*!< 0x40 */
    __IO ETH_RCR_TypeDef  ETH_RCR;                     /*!< 0x44 */
    __IO ETH_CPUTAG_TypeDef  ETH_CPUTAG;               /*!< 0x48 */
    __IO ETH_CONFIG_TypeDef  ETH_CONFIG;               /*!< 0x4C */
    __IO ETH_CPUTAG1_TypeDef  ETH_CPUTAG1;             /*!< 0x50 */
    __IO uint32_t  RSVD1;                              /*!< 0x54 */
    __IO ETH_MSR_TypeDef  ETH_MSR;                     /*!< 0x58 */
    __IO ETH_MIIAR_TypeDef  ETH_MIIAR;                 /*!< 0x5C */
    __IO ETH_SWINT_TypeDef  ETH_SWINT;                 /*!< 0x60 */
    __IO ETH_VLAN_TypeDef  ETH_VLAN;                   /*!< 0x64 */
    __IO uint32_t  RSVD2[2];                           /*!< 0x68 */
    __IO ETH_LED_CTRL_TypeDef  ETH_LED_CTRL;           /*!< 0x70 */
    __IO uint32_t  RSVD3[3];                           /*!< 0x74 */
    __IO ETH_BIST_TypeDef  ETH_BIST;                   /*!< 0x80 */
    __IO ETH_PGLBK_TypeDef  ETH_PGLBK;                 /*!< 0x84 */
    __IO ETH_EEE_CR1_TypeDef  ETH_EEE_CR1;             /*!< 0x88 */
    __IO ETH_EEE_CR2_TypeDef  ETH_EEE_CR2;             /*!< 0x8C */
    __IO ETH_EEE_CR3_TypeDef  ETH_EEE_CR3;             /*!< 0x90 */
    __IO ETH_EEE_CR4_TypeDef  ETH_EEE_CR4;             /*!< 0x94 */
    __IO ETH_EEE_LPI_TMO_TypeDef  ETH_EEE_LPI_TMO;     /*!< 0x98 */
    __IO ETH_EEE_LPI_TM1_TypeDef  ETH_EEE_LPI_TM1;     /*!< 0x9C */
    __IO uint32_t  RSVD4[4];                           /*!< 0xA0 */
    __IO ETH_EEEP_CR1_TypeDef  ETH_EEEP_CR1;           /*!< 0xB0 */
    __IO ETH_EEEP_CR2_TypeDef  ETH_EEEP_CR2;           /*!< 0xB4 */
    __IO ETH_EEEP_CR3_TypeDef  ETH_EEEP_CR3;           /*!< 0xB8 */
    __IO ETH_EEEP_CR4_TypeDef  ETH_EEEP_CR4;           /*!< 0xBC */
    __IO ETH_EEEP_CR5_TypeDef  ETH_EEEP_CR5;           /*!< 0xC0 */
    __IO ETH_EEEP_CR6_TypeDef  ETH_EEEP_CR6;           /*!< 0xC4 */
    __IO ETH_EEEP_CR7_TypeDef  ETH_EEEP_CR7;           /*!< 0xC8 */
    __IO uint32_t  RSVD5;                              /*!< 0xCC */
    __IO ETH_IMR0_TypeDef  ETH_IMR0;                   /*!< 0xD0 */
    __IO ETH_IMR1_TypeDef  ETH_IMR1;                   /*!< 0xD4 */
    __IO ETH_ISR1_TypeDef  ETH_ISR1;                   /*!< 0xD8 */
    __IO ETH_INT_R_TypeDef  ETH_INT_R;                 /*!< 0xDC */
    __IO ETH_RT_PDOCR_TypeDef  ETH_RT_PDOCR;           /*!< 0xE0 */
    __IO ETH_CCR_TypeDef  ETH_CCR;                     /*!< 0xE4 */
    __IO uint32_t  RSVD6[2];                           /*!< 0xE8 */
    __IO ETH_IMR_TypeDef  ETH_IMR;                     /*!< 0xF0 */
    __IO ETH_ISR_TypeDef  ETH_ISR;                     /*!< 0xF4 */
} ETH_TypeDef;

/*============================================================================*
 *                          ETHERNET Declaration
 *============================================================================*/
#define ETH                ((ETH_TypeDef *) ETHERNET_CFG_BASE)


#ifdef  __cplusplus
}
#endif /* __cplusplus */

#endif /* RTL_ETHERNET_DEF_H */
